quanhengwen/STM32F1xWorkSpace19/Examples/USB/Virtual_COM_Port/source/Virtual_COM_Port.c
/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
* File Name          : hw_config.c
* Author             : MCD Application Team
* Version            : V2.2.0
* Date               : 06/13/2008
* Description        : Hardware Configuration & Setup
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/
#ifdef Virtual_COM_Port

/******************************** 说明20160912**********************************
********************************************************************************
* 功能：用于 USB硬件配置
* 
* 
* 
* 
* 
*******************************************************************************/
/* Includes ------------------------------------------------------------------*/
#include "Virtual_COM_Port.h"
//#include "stm32f10x_it.h"

#include "BqApp.h"

//#include "hw_config.h"
//#include "platform_config.h"
#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间


#include "STM32_GPIO.H"
#include "STM32_USART.H"

#include "STM32_SYSTICK.H"
#include "STM32_TIM.H"

#include "BQ26100.H"

#include "usb_lib.h"
#include "usb_prop.h"
#include "usb_desc.h"
#include "usb_istr.h"
#include "usb_pwr.h"
#include "usb_type.h"
#include "usb_core.h"			//USB总线数据处理的核心文件

#include "usb_endp.h"
#include "usb_data.h"
#include "hw_config.h"



/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define lora	0
#define bq26100V1	0
#define bq26100V2	1
#define STM32_FSMC 0
#define STM32_USB_TEST 0


#if PS005
		#define USB_DISCONNECT            GPIOA  
		#define USB_DISCONNECT_PIN        GPIO_Pin_8
		#define RCC_APB2Periph_GPIO_DISCONNECT      RCC_APB2Periph_GPIOA
		
		#define ComPort	USART1
	#elif lora
	  #define USB_DISCONNECT            GPIOA  
		#define USB_DISCONNECT_PIN        GPIO_Pin_15
		#define RCC_APB2Periph_GPIO_DISCONNECT      RCC_APB2Periph_GPIOA
		
		#define ComPort	USART1
	#elif bq26100V1
	
	  #define USB_DISCONNECT            GPIOA  
		#define USB_DISCONNECT_PIN        GPIO_Pin_15
		
		#define ComPort	USART1

#elif bq26100V2
	
	  #define USB_DISCONNECT            GPIOA  
		#define USB_DISCONNECT_PIN        GPIO_Pin_15
		
		#define ComPort	USART1		//
		
	#elif STM32_USB_TEST
	  #define USB_DISCONNECT            GPIOA  
		#define USB_DISCONNECT_PIN        GPIO_Pin_15
		#define RCC_APB2Periph_GPIO_DISCONNECT      RCC_APB2Periph_GPIOA
		
		#define ComPort	USART1
	#elif STM32_FSMC
	  #define USB_DISCONNECT            GPIOA  
		#define USB_DISCONNECT_PIN        GPIO_Pin_8
		#define RCC_APB2Periph_GPIO_DISCONNECT      RCC_APB2Periph_GPIOA
		
		#define ComPort	USART1
	#else
	  #define USB_DISCONNECT            GPIOA  
		#define USB_DISCONNECT_PIN        GPIO_Pin_8
		#define RCC_APB2Periph_GPIO_DISCONNECT      RCC_APB2Periph_GPIOA
		
		#define ComPort	USART1
#endif


/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
//USART_InitTypeDef USART_InitStructure;


/* Extern variables ----------------------------------------------------------*/
u8 buffer_in[USB_BUFFER_SIZE];

//u8 buffer_rx[VIRTUAL_COM_PORT_DATA_SIZE];
//u8 buffer_tx[VIRTUAL_COM_PORT_DATA_SIZE];

//u32 USART_Rx_ptr_in = 0;
//u32 USART_Rx_ptr_out = 0;
//u32 USART_Rx_length  = 0;

u8 Usart_tx_flg=0;
unsigned short virtual_com_time = 0;


extern u32 count_in;
extern LINE_CODING linecoding;

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
void api_usb_virtual_gpio_configuration(void);

extern void api_usb_hw_initialize(void);
void USB_CMD(FunctionalState NewState);

/*******************************************************************************
* Function Name  : Set_System
* Description    : Configures Main system clocks & power
* Input          : None.
* Return         : None.
*******************************************************************************/
void api_usb_virtual_com_configuration(void)		//虚拟串口配置
{
	#include "BqApp.h"
	api_usb_virtual_gpio_configuration();
	
	api_usb_hw_initialize();
	
//#if bq26100V2	
//	api_BqApp_configuration();
//#endif
  
//	while(1)
//	{
//		api_usb_virtual_com_server();
//	}
//	 PWM_OUT(TIM2,PWM_OUTChannel1,1,500);	//PWM设定-20161127版本	占空比1/1000
	SysTick_Configuration(1000);	//系统嘀嗒时钟配置72MHz,单位为uS
	

}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void api_usb_virtual_com_server(void)
{	
	static unsigned short time = 0;
	
	if(bDeviceState != CONFIGURED)
	{
		virtual_com_time=0;
		return;
	}
	if(virtual_com_time<2000)	//等待USB初始化1秒
	{
		virtual_com_time ++;
		return ;
	}
	
#if bq26100V2
	api_BqApp_server();
#else
	usb_to_uart_server();
	USART_To_USB_Send_Data();
#endif	
}
/*******************************************************************************
*函数名		: function
*功能描述	:	串口接收服务函数
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:	api_usart_dma_printf(USART2,"中文ENG=%d\n",num);
*特别说明	:	在DMA发送完成后需要释放动态空间，free(USART_BUFFER);
					:	USART_BUFFER定义在STM32_USART.H
*******************************************************************************/
unsigned short api_usb_printf(const char *format,...)
{
	
//		va_list ap; 										//VA_LIST 是在C语言中解决变参问题的一组宏，所在头文件：#include <stdarg.h>,用于获取不确定个数的参数
//    static char string[ 256 ];			//定义数组，
//    va_start( ap, format );
//    vsprintf( string , format, ap );    
//    va_end( ap );	

