quanhengwen/STM32F1xWorkSpace19/Examples/USB/Virtual_COM_Port/source/Virtual_COM_Port.c
	unsigned short	str_len=0;
	unsigned char		format_buffer[256]={0};
	
	//3)**********args为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list args;  
	//5)**********初始化args的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(args, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	str_len = vsprintf((char*)format_buffer, format, args);
	//7)**********结束可变参数的获取
	va_end(args); 
	//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送	
	return api_usb_in_add_data((u8*)format_buffer,str_len);
	//return set_usart_tx_dma_buffer(USARTx,(u8*)format_buffer,str_len);		//串口DMA发送程序
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void api_usb_virtual_gpio_configuration(void)
{
	GPIO_Configuration_OPP50(USB_DISCONNECT,USB_DISCONNECT_PIN);			//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度50MHz----V20170605
	USB_CMD(DISABLE);
}
//------------------------------------------------------------------------------



//------------------------------------------------------------------------------
/*******************************************************************************
* Function Name  : USB_Cable_Config
* Description    : Software Connection/Disconnection of USB Cable
* Input          : None.
* Return         : Status
*******************************************************************************/
void USB_CMD(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
//    GPIO_ResetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
		GPIO_SetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
  }
  else
  {
//    GPIO_SetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
		GPIO_ResetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
  }
}
unsigned long sendnum=0;
unsigned long sendednum=0;

extern unsigned long usbsavenum;

/*******************************************************************************
* Function Name  :  UART0_Config_Default.
* Description    :  configure the UART 0 with default values.	串口的默认配置值
* Input          :  None.
* Return         :  None.
*******************************************************************************/
void USART_Config_Default(void)
{
	USART_InitTypeDef USART_InitStructure;
//--------------原程序
//	linecoding
	USART_DeInit(ComPort);
	
	USART_InitStructure.USART_BaudRate    = 19200; 					  //波特率
	USART_InitStructure.USART_WordLength  = USART_WordLength_8b;		    //数据位
	USART_InitStructure.USART_StopBits    = USART_StopBits_1;				    //停止位
	USART_InitStructure.USART_Parity      = USART_Parity_No ; 					//奇偶校验
	USART_InitStructure.USART_Mode        = USART_Mode_Rx | USART_Mode_Tx;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//流控
	USART_Init(ComPort, &USART_InitStructure);											//初始化串口
	
	api_usart_configuration_ST(ComPort,&USART_InitStructure,USB_BUFFER_SIZE);	//USART_DMA配置--结构体形式，不开中断	
}

/*******************************************************************************
* Function Name  :  UART0_Config.
* Description    :  Configure the UART 1 according to the linecoding structure.
										根据line coding 结构体配置串口.
* Input          :  None.
* Return         :  Configuration status
                    TRUE : configuration done with success
                    FALSE : configuration aborted.
*******************************************************************************/
char USART_Config(void)
{
	USART_InitTypeDef USART_InitStructure;
  /* set the Stop bit*/
	/**************设置停止位**************/
  switch (linecoding.format)
  {
    case 0:
      USART_InitStructure.USART_StopBits = USART_StopBits_1;		//1位停止位
      break;
    case 1:
      USART_InitStructure.USART_StopBits = USART_StopBits_1_5;	//1.5为停止位
      break;
    case 2:
      USART_InitStructure.USART_StopBits = USART_StopBits_2;		//2位停止位
      break;
    default :
    {
      USART_Config_Default();																		//默认配置
      return (0);
    }
  }

  /* set the parity bit*/
	/**************设置校验位**************/
  switch (linecoding.paritytype)
  {
    case 0:
      USART_InitStructure.USART_Parity = USART_Parity_No;			//没有校验
      break;
    case 1:
      USART_InitStructure.USART_Parity = USART_Parity_Even;		//偶校验
      break;	
    case 2:
      USART_InitStructure.USART_Parity = USART_Parity_Odd;		//奇校验
      break;
    default :
    {
      USART_Config_Default();																	//默认配置
      return (0);
    }
  }

  /*set the data type : only 8bits and 9bits is supported */
	/**************设置数据位: 8位或9位**************/
  switch (linecoding.datatype)
  {
    case 0x07:
      USART_InitStructure.USART_WordLength = USART_WordLength_8b;	//8为数据位，这个选项就校验位必须设置(奇校验/偶校验)
      break;
    case 0x08:
      USART_InitStructure.USART_WordLength = USART_WordLength_8b;	//USART_WordLength_9b;	//9位数据位
      break;
    default :
    {
      USART_Config_Default();																//默认配置
      return (0);
    }
  }
  USART_InitStructure.USART_BaudRate = linecoding.bitrate;													//设置波特率
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;		//设置没有硬件数据流控制
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;										//使能接收、发送
  USART_Init(ComPort, &USART_InitStructure);																				//初始化串口
  USART_Cmd(ComPort, ENABLE);																												//使能串口
	
	api_usart_configuration_ST(ComPort,&USART_InitStructure,USB_BUFFER_SIZE);	//USART_DMA配置--结构体形式，不开中断
	
  return (1);
}
/*******************************************************************************
* Function Name  : USB_To_UART_Send_Data.
* Description    : send the received data from USB to the UART 0.将USB接收到的数据从串口发送数据
* Input          : data_buffer: data address.
                   Nb_bytes: number of bytes to send.
* Return         : none.
*******************************************************************************/
void USB_To_USART_Send_Data(u8* data_buffer, u8 Nb_bytes)
{
	Usart_tx_flg=1;
	api_usart_send(ComPort,data_buffer,(u16)Nb_bytes);		//自定义printf串口DMA发送程序
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void usb_to_uart_server(void)
{
	unsigned short len	=	0;
	static unsigned char time=0;
	unsigned char buffer[USB_BUFFER_SIZE]={0};
	if(bDeviceState != CONFIGURED)
  {
		return;
	}
	if(0!=get_usart_tx_status(ComPort))		//串口状态检查
	{
		return ;
	}
	//-----------------------------------无数据
	if(0==api_usb_out_get_read_enable())
	{
		return;
	}
	if(time++<10)		//连续帧间隔8ms
		return ;
	time = 0;

	len	=	api_usb_out_get_data(buffer);
	if(len)
	{
		sendnum+=len;
		sendednum+=api_usart_send(ComPort,buffer,(u16)len);		//自定义printf串口DMA发送程序
	}
}

