quanhengwen/STM32F1xWorkSpace19/Examples/USB/Virtual_COM_Port/source/Virtual_COM_Port.c
/*******************************************************************************
* Function Name  : Virtual_Com_Port_Reset
* Description    : Virtual_Com_Port Mouse reset routine	复位
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void Virtual_Com_Port_Reset(void)
{
  /* Set Virtual_Com_Port DEVICE as not configured */
  pInformation->Current_Configuration = 0;				//设置当前的配置为0，表示没有配置过

  /* Current Feature initialization */
  pInformation->Current_Feature = Virtual_Com_Port_ConfigDescriptor[7];	//当前的属性，bmAttributes:设备的一些特性，0xc0表示自供电，不支持远程唤醒

  /* Set Virtual_Com_Port DEVICE with the default Interface*/
  pInformation->Current_Interface = 0;
  SetBTABLE(BTABLE_ADDRESS);

  /* Initialize Endpoint 0 */
	/* *****初始化端点0***** */
  SetEPType(ENDP0, EP_CONTROL);													//设置端点0为控制端点
  SetEPTxStatus(ENDP0, EP_TX_STALL);										//设置端点0发送延时
  SetEPRxAddr(ENDP0, ENDP0_RXADDR);											//设置端点0的接收缓冲区地址
  SetEPTxAddr(ENDP0, ENDP0_TXADDR);											//设置端点0的发送缓冲区地址
  Clear_Status_Out(ENDP0);															//清除端点0的状态
  SetEPRxCount(ENDP0, Device_Property.MaxPacketSize);		//设置端点0的接收最大包
  SetEPRxValid(ENDP0);																	//使能接收状态

  /* Initialize Endpoint 1 */
	/* *****初始化端点1***** */
  SetEPType(ENDP1, EP_BULK);														//设置端点1为进批量传输
  SetEPTxAddr(ENDP1, ENDP1_TXADDR);											//设置端点发送地址
  SetEPTxStatus(ENDP1, EP_TX_NAK);											//设置端点1的发送不响应
  SetEPRxStatus(ENDP1, EP_RX_DIS);											//设置端点1不接收

  /* Initialize Endpoint 2 */
	/* *****初始化端点2***** */
  SetEPType(ENDP2, EP_INTERRUPT);												//设置端点2为中断传输
  SetEPTxAddr(ENDP2, ENDP2_TXADDR);											//设置端点2发送地址
  SetEPRxStatus(ENDP2, EP_RX_DIS);											//设置端点2不接收状态
  SetEPTxStatus(ENDP2, EP_TX_NAK);											//设置端点2端点2为接收不响应

  /* Initialize Endpoint 3 */
	/* *****初始化端点3***** */
  SetEPType(ENDP3, EP_BULK);														//设置端点3为仅批量传输
  SetEPRxAddr(ENDP3, ENDP3_RXADDR);											//设置端点3接收地址
  SetEPRxCount(ENDP3, VIRTUAL_COM_PORT_DATA_SIZE);			//设置端点3的计数值
  SetEPRxStatus(ENDP3, EP_RX_VALID);										//设置端点3接收有效
  SetEPTxStatus(ENDP3, EP_TX_DIS);											//设置端点3不发送

  /* Set this device to response on default address */
  SetDeviceAddress(0);																	//设置设备为默认地址为0

  bDeviceState = ATTACHED;
}

/*******************************************************************************
* Function Name  : Virtual_Com_Port_SetConfiguration.
* Description    : Udpade the device state to configured.更新设备配置状态
* 描述			    	: 配置
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void Virtual_Com_Port_SetConfiguration(void)
{
  DEVICE_INFO *pInfo = &Device_Info;

  if (pInfo->Current_Configuration != 0)
  {
    /* Device configured */
    bDeviceState = CONFIGURED;
  }
}

/*******************************************************************************
* Function Name  : Virtual_Com_Port_SetConfiguration.
* Description    : Udpade the device state to addressed.更新设备的编址状态
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void Virtual_Com_Port_SetDeviceAddress (void)
{
  bDeviceState = ADDRESSED;
}

/*******************************************************************************
* Function Name  : Virtual_Com_Port_Status_In.
* Description    : Virtual COM Port Status In Routine.状态输入函数
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void Virtual_Com_Port_Status_In(void)
{
  if (Request == SET_LINE_CODING)
  {
    USART_Config();
    Request = 0;
  }
}

/*******************************************************************************
* Function Name  : Virtual_Com_Port_Status_Out
* Description    : Virtual COM Port Status OUT Routine.状态输出函数
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void Virtual_Com_Port_Status_Out(void)
{}

/*******************************************************************************
* Function Name  : Virtual_Com_Port_Data_Setup
* Description    : handle the data class specific requests 处理有数据阶段的特殊类请求
* Input          : Request Nb.
* Output         : None.
* Return         : USB_UNSUPPORT or USB_SUCCESS.
*******************************************************************************/
RESULT Virtual_Com_Port_Data_Setup(u8 RequestNo)
{
  u8    *(*CopyRoutine)(u16);

  CopyRoutine = NULL;
	//请求的字段
  if (RequestNo == GET_LINE_CODING)		//****************************获取串口通信信息请求														
  {
    if (Type_Recipient == (CLASS_REQUEST | INTERFACE_RECIPIENT))	//类请求，请求的接收者是接口
    {
      CopyRoutine = Virtual_Com_Port_GetLineCoding;	//**************指针函数指向Virtual_Com_Port_GetLineCoding函数
    }
  }
  else if (RequestNo == SET_LINE_CODING)	//************************设置串口通讯信息请求
  {
    if (Type_Recipient == (CLASS_REQUEST | INTERFACE_RECIPIENT))	//类请求，请求的接收者是接口
    {
      CopyRoutine = Virtual_Com_Port_SetLineCoding;	//**************指针函数指向Virtual_Com_Port_SetLineCoding函数
    }
    Request = SET_LINE_CODING;
  }

  if (CopyRoutine == NULL)
  {
    return USB_UNSUPPORT;
  }

  pInformation->Ctrl_Info.CopyData = CopyRoutine;		//**************注册指针指向的函数
  pInformation->Ctrl_Info.Usb_wOffset = 0;
  (*CopyRoutine)(0);					//************************************调用该函数
  return USB_SUCCESS;
}

/*******************************************************************************
* Function Name  : Virtual_Com_Port_NoData_Setup.
* Description    : handle the no data class specific requests.处理没有数据阶段特殊类请求
* Input          : Request Nb.
* Output         : None.
* Return         : USB_UNSUPPORT or USB_SUCCESS.
*******************************************************************************/
RESULT Virtual_Com_Port_NoData_Setup(u8 RequestNo)
{

  if (Type_Recipient == (CLASS_REQUEST | INTERFACE_RECIPIENT))	//***类请求，请求的接收者是接口
  {
    if (RequestNo == SET_COMM_FEATURE)		//*************************设置虚拟串口特性
    {
      return USB_SUCCESS;
    }
    else if (RequestNo == SET_CONTROL_LINE_STATE)		//***************设置控制信息状态
    {
      return USB_SUCCESS;
    }
  }

  return USB_UNSUPPORT;
}

